traces/04-enumerate-pull.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:addata="http://schemas.microsoft.com/2008/1/ActiveDirectory/Data" xmlns:ad="http://schemas.microsoft.com/2008/1/ActiveDirectory" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<s:Header>
<a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Pull</a:Action>
<ad:instance>ldap:389</ad:instance>
<a:MessageID>urn:uuid:ad7ce066-56cd-4411-bc19-c029fc731f48</a:MessageID>
<a:ReplyTo>
<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
</a:ReplyTo>
<a:To s:mustUnderstand="1">net.tcp://win2016.ad.garming.example.com:9389/ActiveDirectoryWebServices/Windows/Enumeration</a:To>
</s:Header>
<s:Body xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration">
<wsen:Pull>
<wsen:EnumerationContext>e78af0c4-8a5d-4691-ae89-40d71ea9289f</wsen:EnumerationContext>
<wsen:MaxElements>2</wsen:MaxElements>
<ad:controls>
<ad:control type="1.2.840.113556.1.4.801" criticality="true">
<ad:controlValue xsi:type="xsd:base64Binary">MIQAAAADAgEH</ad:controlValue>
</ad:control>
</ad:controls>
</wsen:Pull>
</s:Body>
</s:Envelope>
